Repository: brunoeiterer/CV
Catalog: BrunoEitererCVDesktopApp/BrunoEitererCV/Strings/Resources-*.resw
Source language: en_us
Languages: pt_br

# Scrum.Text
source: I've used Scrum as the Agile Framework for development since my time at the Floripa-Sat project, and I've used it in all my professional experiences.
pt_br: Uso Scrum como Framework Agile desde minha participação no Floripa-Sat, incluindo todas as minhas experiências profissionais.

# JiraAndConfluence.YearsOfExperience
source: 7 years of experience
pt_br: 7 anos de experiência

# JiraAndConfluence.Text
source: I've started using Jira and Confluence during my internship at ASML, and have used them in all my professional experiences. I'm confortable using their tools, and have even developed plugins for them to automate tasks during my time at Gertec.
pt_br: Comecei a usar Jira e Confluence durante meu estágio na ASML, e usei os dois em todas as minhas experiências profissionais. Me sinto confortável usando suas ferramentas, e já até desenvolvi plugins para os dois para automação de tarefas na Gertec.

# MSOffice.YearsOfExperience
source: 15+ years of experience
pt_br: 15+ anos de experiência

# MSOffice.Text
source: I've used MS Office since my school days, since it is such widespread set of tools. Now a days I prefer to use other tools for documentation (like wikis), but I still use MS Office if the task requires it, like generating the Release Notes for new versions at RDI. I try to automate most of this work, but sometimes manual intervention is still required.
pt_br: Uso MS Office desde que sou estudante, já que são ferramentas amplamente utilizadas. Hoje em dia prefiro usar outras ferramentas para documentação (como wikis), mas ainda uso MS Office se necessário, por exemplo para gerar Release Notes de novas versões na RDI. Eu procuro automatizar a maior parte desse trabalho, mas as vezes ainda é necessário intervenção manual.

# Lifejournaler.Text
source: Lifejournaler is a lightweight open-source journaling app. It allows recording daily thoughts and behaviors, tracking mood variations over time and providing statistics.<LineBreak/> The frontend is built with <Bold>Next.js (typescript)</Bold> and the backend uses <Bold>C# ASP.NET Core</Bold> with a <Bold>PosgreSQL</Bold> database, accessed through the <Bold>Entity Framework.</Bold><LineBreak/> The code is available on <Hyperlink NavigateUri="https://github.com/brunoeiterer/lifejournaler">Github</Hyperlink> and the app is running at <Hyperlink NavigateUri="https://lifejournaler.com/">https://lifejournaler.com/</Hyperlink>.<LineBreak/> The app is hosted on a <Bold>Linux VM</Bold> on the <Bold>Oracle Cloud</Bold>.
pt_br: Lifejournaler é um aplicativo de diário leve e open-source. Nele você pode anotar pensamentos e comportamentos, rastrear variações de humor e verificar estatísticas.<LineBreak/> O frontend foi desenvolvido com <Bold>Next.js (typescript)</Bold> e o backend usa <Bold>C# ASP.NET Core</Bold> com um banco de dados <Bold>PosgreSQL</Bold>, acessado através do <Bold>Entity Framework.</Bold><LineBreak/> O código está disponível no <Hyperlink NavigateUri="https://github.com/brunoeiterer/lifejournaler">Github</Hyperlink> e o aplicativo está rodando em <Hyperlink NavigateUri="https://lifejournaler.com/">https://lifejournaler.com/</Hyperlink>.<LineBreak/> A hospedagem é feita em uma <Bold>VM Linux</Bold> na <Bold>Oracle Cloud</Bold>.

# PrintReady.Text
source: PrintReady is a Windows desktop app that automatically resizes and add borders to your pictures, making them ready for printing, avoiding unwanted stretching and cut-offs.<LineBreak/> The tech stack used is <Bold>C#</Bold> with <Bold>.NET8</Bold> and <Bold>WinUi 3</Bold>. <LineBreak/> The code is available on <Hyperlink NavigateUri="https://github.com/brunoeiterer/PrintReady">Github</Hyperlink> and the app is available at the <Hyperlink NavigateUri="https://apps.microsoft.com/detail/9nng012q1l9n">Microsoft Store</Hyperlink>.
pt_br: PrintReady é um aplicativo desktop para Windows que redimensiona e adiciona bordas automaticamente nas suas fotos, deixando elas prontas para impressão, evitando distorções e cortes indesejados.<LineBreak/> A tech stack usada é <Bold>C#</Bold> com <Bold>.NET8</Bold> e <Bold>WinUi 3</Bold>.<LineBreak/> O código está disponível no <Hyperlink NavigateUri="https://github.com/brunoeiterer/PrintReady">Github</Hyperlink> e o aplicativo está disponível na <Hyperlink NavigateUri="https://apps.microsoft.com/detail/9nng012q1l9n?hl=pt-BR&amp;gl=BR">Microsoft Store</Hyperlink>.

# CV.Text
source: This CV is also one of my side projects.<LineBreak/> The tech stack used is <Bold>C#</Bold> with <Bold>.NET8</Bold> and <Bold>WinUi 3</Bold>.<LineBreak/> The code is available on <Hyperlink NavigateUri="https://github.com/brunoeiterer/CV">Github</Hyperlink>.
pt_br: Esse CV também é um dos meus projetos pessoais.<LineBreak/> A tech stack usada é <Bold>C#</Bold> com <Bold>.NET8</Bold> e <Bold>WinUi 3</Bold>.<LineBreak/> O código está disponível no <Hyperlink NavigateUri="https://github.com/brunoeiterer/CV">Github</Hyperlink>.

# Game.Text
source: I'm developing a game which doesn't have a name yet. It is a walking simulator type of game, where the story is discovered through notes found around the environments.<LineBreak/> I'm doing all the development, including the 3D modeling in <Bold>Blender</Bold>, using <Bold>Godot</Bold> as the game engine and <Bold>C#</Bold> as the gameplay programming language.
pt_br: Estou desenvolvendo um jogo que ainda não tem nome. O estilo do jogo é walking simulator, no qual a história vai sendo contanda através de notas encontradas nos cenários. <LineBreak/>Estou fazendo todo o desenvolvimento, incluindo a modelagem 3D no <Bold>Blender</Bold>, usando <Bold>Godot</Bold> como o game engine e <Bold>C#</Bold> como a linguagem de programação do gameplay.

# BitbucketCommitPlotter.Text
source: BitbucketCommitPlotter is an application that generates a Github-like commit graph for Bitbucket commits. <LineBreak/> The tech stack used is <Bold>C#</Bold> with <Bold>.NET8</Bold>. <LineBreak/> The code is available on <Hyperlink NavigateUri="https://github.com/brunoeiterer/BitbucketCommitPlotter">Github</Hyperlink>.
pt_br: BitbucketCommitPlotter é um aplicativo que gera um gráfico de commits semelhante ao do Github para commits do Bitbucket. <LineBreak/> A tech stack usada é <Bold>C#</Bold> com <Bold>.NET8</Bold>. <LineBreak/> O código está disponível no <Hyperlink NavigateUri="https://github.com/brunoeiterer/BitbucketCommitPlotter">Github</Hyperlink>.

# IPCAProcessor.Text
source: IPCAProcessor is an app that processes IPCA (brazillian inflation data) and outputs it in several different formats, like JSON, PNG graph, CSV and SQL dump.<LineBreak/> The tech stack used is <Bold>C#</Bold> with <Bold>.NET8</Bold>.<LineBreak/> The code is available on <Hyperlink NavigateUri="https://github.com/brunoeiterer/IPCAProcessor">Github</Hyperlink>.
pt_br: IPCAProcessor é um aplicativo que processa dados do IPCA (Índice Nacional de Preços ao Consumidor Amplo) e os disponibiliza em diversos formatos, como JSON, gráfico PNG, CSV e SQL dump. <LineBreak/> A tech stack usada é <Bold>C#</Bold> com <Bold>.NET8</Bold>. <LineBreak/> O código está disponível no <Hyperlink NavigateUri="https://github.com/brunoeiterer/IPCAProcessor">Github</Hyperlink>.

# ElectricalEngineering.Title
source: Electrical Engineering Bachelor
pt_br: Engenharia Elétrica
